<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.1b
# *Data Cleaning with Pandas*

In this lab we work with a file that has messy column names and a combination of missing and invalid data to be cleaned.

To start with load `rock.csv` into a dataframe.

In [31]:
# ANSWER
import pandas as pd
rock_csv = 'rock.csv'
rock = pd.read_csv(rock_csv)

### Check Column Names

Check column names and clean by converting all names to lowercase, replacing spaces with underscores (`_`) and removing question marks or asterisk (`*`) characters.

In [5]:
# ANSWER
rock.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

### Replace Null Values With 0

Check 'release_year' column whether this column has any null values or not. Replace null values with 0.

In [7]:
# ANSWER
rock.isnull().sum()

Song Clean        0
ARTIST CLEAN      0
Release Year    577
COMBINED          0
First?            0
Year?             0
PlayCount         0
F*G               0
dtype: int64

## Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [9]:
# ANSWER
rock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2230 entries, 0 to 2229
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Song Clean    2230 non-null   object
 1   ARTIST CLEAN  2230 non-null   object
 2   Release Year  1653 non-null   object
 3   COMBINED      2230 non-null   object
 4   First?        2230 non-null   int64
 5   Year?         2230 non-null   int64
 6   PlayCount     2230 non-null   int64
 7   F*G           2230 non-null   int64
dtypes: int64(4), object(4)
memory usage: 139.5+ KB

## Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

In [11]:
# ANSWER
def check_min_max(df):
    # Check min, max of each column
    print(df.describe().T[['min', 'max']])

## Write Some Functions

### Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [43]:
# ANSWER
rock.dtypes

Song Clean      object
ARTIST CLEAN    object
Release Year    object
COMBINED        object
First?           int64
Year?            int64
PlayCount        int64
F*G              int64
dtype: object

In [15]:
def check_song(row):
    print('Song: ', row['song_clean'])
    print('Artist: ', row['artist_clean'])
    print('Released before 1970: ', row['release_year'] < 1970)
    print('\n')

In [17]:
rock.iloc[0]

Song Clean                     Caught Up in You
ARTIST CLEAN                        .38 Special
Release Year                               1982
COMBINED        Caught Up in You by .38 Special
First?                                        1
Year?                                         1
PlayCount                                    82
F*G                                          82
Name: 0, dtype: object

### Write a function that converts a column in a DataFrame to a numeric type and otherwise replaces entries with np.nan

In [37]:
# ANSWER
import pandas as pd
def convert_to_numeric(column):
    column = pd.to_numeric(column, errors='coerce')
    return column

In [45]:
rock['COMBINED']

0                         Caught Up in You by .38 Special
1                             Fantasy Girl by .38 Special
2                          Hold On Loosely by .38 Special
3                   Rockin' Into the Night by .38 Special
4                               Art For Arts Sake by 10cc
                              ...
2225                    She Loves My Automobile by ZZ Top
2226                          Tube Snake Boogie by ZZ Top
2227                                       Tush by ZZ Top
2228                                 TV Dinners by ZZ Top
2229    WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...
Name: COMBINED, Length: 2230, dtype: object

### Apply this last function to your dataset

In [57]:
# ANSWER
rock[['Release Year', 'COMBINED', 'First?', 'Year?', 'PlayCount', 'F*G']].apply(convert_to_numeric)

      Release Year  COMBINED  First?  Year?  PlayCount  F*G
0           1982.0       NaN       1      1         82   82
1              NaN       NaN       1      0          3    0
2           1981.0       NaN       1      1         85   85
3           1980.0       NaN       1      1         18   18
4           1975.0       NaN       1      1          1    1
...            ...       ...     ...    ...        ...  ...
2225           NaN       NaN       1      0          1    0
2226        1981.0       NaN       1      1         32   32
2227        1975.0       NaN       1      1        109  109
2228        1983.0       NaN       1      1          1    1
2229        1973.0       NaN       1      1          2    2

[2230 rows x 6 columns]

### 'Describe' the new DataFrame

In [59]:
# ANSWER
rock.describe().T

            count       mean        std  min  25%  50%   75%    max
First?     2230.0   1.000000   0.000000  1.0  1.0  1.0   1.0    1.0
Year?      2230.0   0.741256   0.438043  0.0  0.0  1.0   1.0    1.0
PlayCount  2230.0  16.872646  25.302972  0.0  1.0  4.0  21.0  142.0
F*G        2230.0  15.048430  25.288366  0.0  0.0  3.0  18.0  142.0

>



---



---



> > > > > > > > > © 2024 Institute of Data


---



---